{
  "backend/main.mo": "Minimal Motoko actor with no functions or logic.",
  "feature_evidence.json": "Feature evidence list mapping UI redesign, readability fixes, asset updates, and theme cleanup to affected frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and styling updates of all major frontend files.",
  "frontend/index.css": "Global Tailwind/OKLCH theme variables defining the dark‑only color system and base styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the root React app.",
  "frontend/src/App.tsx": "Main app component managing section navigation and rendering all site sections.",
  "frontend/src/components/icons/DiscordIcon.tsx": "Discord SVG icon component with configurable className.",
  "frontend/src/components/marketing/ContactSection.tsx": "Contact section showing WhatsApp and Discord buttons styled with glassmorphism and neon effects.",
  "frontend/src/components/marketing/DashboardSection.tsx": "Dashboard with tab navigation and content panels including payment, support, and profile sections.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero section with premium banner, layered gradients, and large neon‑styled headings.",
  "frontend/src/components/marketing/PanelCard.tsx": "Displays a panel card showing its name, price range, and a buy button that triggers a callback.",
  "frontend/src/components/marketing/PanelsSection.tsx": "Provides search, filter, listing of panels, and opens a payment panel when a panel is selected.",
  "frontend/src/components/marketing/PaymentPanel.tsx": "Handles duration selection, UPI copying, and generates WhatsApp payment proof links for a selected panel.",
  "frontend/src/components/marketing/PricingTableSection.tsx": "Renders a pricing table for all panels with durations in desktop and mobile-friendly views.",
  "frontend/src/components/marketing/SectionNavigation.tsx": "Vertical navigation bar allowing switching between site sections with icons.",
  "frontend/src/components/marketing/SiteFooter.tsx": "Displays footer with copyright text and a referral link to caffeine.ai.",
  "frontend/src/components/marketing/SiteHeader.tsx": "Shows the site header with logo and branding text.",
  "frontend/src/components/marketing/ThemeToggle.tsx": "Empty placeholder component for theme switching.",
  "frontend/src/config/payment.ts": "Exports the static UPI ID used for payments.",
  "frontend/src/config/social.ts": "Exports WhatsApp number and Discord invite URL.",
  "frontend/src/data/panels.ts": "Defines panel and pricing interfaces and provides a list of panel pricing data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity React context and provider that manages AuthClient creation, login, logout, and identity state.",
  "frontend/src/hooks/useTheme.ts": "Empty file (no content).",
  "frontend/src/index.css": "Defines global Tailwind-based dark cyberpunk theme variables and utility classes including neon glow and glassmorphism effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider.",
  "frontend/src/utils/paymentProof.ts": "Builds a WhatsApp link for sending payment proof with optional panel, duration, and amount fields.",
  "frontend/src/utils/whatsapp.ts": "Generates a WhatsApp deep‑link message for initiating a panel purchase.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, shadows, animations, and enabling dark mode and plugins.",
  "project_state.json": "Project state file describing the current UI redesign plan, payment flow changes, issues, and architectural notes."
}