{
  "backend/main.mo": "Minimal Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report listing three feature requirements with associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files and their roles in styling, configuration, components, and utilities.",
  "frontend/index.css": "Tailwind base file defining OKLCH color variables, dark mode overrides, and global styling rules.",
  "frontend/index.html": "Main HTML entry loading fonts and mounting the React app with dark mode enabled.",
  "frontend/src/App.tsx": "Root React component managing section navigation and rendering major site sections conditionally.",
  "frontend/src/components/icons/DiscordIcon.tsx": "SVG-based Discord icon component with customizable className.",
  "frontend/src/components/marketing/ContactSection.tsx": "Contact section showing WhatsApp and Discord buttons using configured constants.",
  "frontend/src/components/marketing/DashboardSection.tsx": "Dashboard with tab-based navigation and dynamic content including payment, panels, support, and status views.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero banner featuring background image, title, subtitle, and neon-themed decorative elements.",
  "frontend/src/components/marketing/PanelCard.tsx": "Panel card displaying pricing options and triggering onBuy actions via card or button interaction.",
  "frontend/src/components/marketing/PanelsSection.tsx": "Displays available panels and opens a payment modal when a panel is selected.",
  "frontend/src/components/marketing/PaymentPanel.tsx": "Shows UPI payment details, copy-to-clipboard functionality, and payment instructions.",
  "frontend/src/components/marketing/PricingTableSection.tsx": "Renders a pricing table for all panels with desktop and mobile layouts.",
  "frontend/src/components/marketing/SectionNavigation.tsx": "Provides a sticky navigation bar for switching between app sections.",
  "frontend/src/components/marketing/SiteFooter.tsx": "Displays site footer with branding, copyright, and a referral link.",
  "frontend/src/components/marketing/SiteHeader.tsx": "Shows the site header with logo and title.",
  "frontend/src/config/payment.ts": "Exports the app’s UPI ID constant.",
  "frontend/src/config/social.ts": "Exports WhatsApp number and Discord invite URL.",
  "frontend/src/data/panels.ts": "Defines panel types and exports pricing data for all panels.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, and identity persistence.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom OKLCH cyberpunk theme colors plus numerous neon, glow, glassmorphism, and hover effect utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, then renders App with global styles.",
  "frontend/src/utils/paymentProof.ts": "Builds a WhatsApp deep-link containing a prefilled payment confirmation message, optionally including the panel name.",
  "frontend/src/utils/whatsapp.ts": "Generates a WhatsApp link with a prefilled message indicating interest in purchasing a specific panel.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended neon/cyberpunk colors, fonts, shadows, animations, and plugins.",
  "project_state.json": "Stores project state, including required UI style, updated payment flow, Discord link rules, and known issues to fix."
}