{
  "backend/main.mo": "Minimal Motoko actor with no functions.",
  "feature_evidence.json": "Feature evidence listing three panel‑pricing related requirements referencing frontend/src/data/panels.ts.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all major frontend files and their roles in styling, UI, and data.",
  "frontend/index.css": "Global Tailwind and OKLCH variable setup defining light/dark tokens and base styling.",
  "frontend/index.html": "Base HTML entry loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Main React app controlling section navigation and rendering corresponding page sections.",
  "frontend/src/components/icons/DiscordIcon.tsx": "SVG-based React component rendering the Discord logo.",
  "frontend/src/components/marketing/ContactSection.tsx": "Contact section showing WhatsApp and Discord buttons using configured links.",
  "frontend/src/components/marketing/DashboardSection.tsx": "Dashboard with tab navigation showing panel, payment, profile, support, or status content.",
  "frontend/src/components/marketing/HeroSection.tsx": "Hero banner with premium imagery, gradients, and animated headings.",
  "frontend/src/components/marketing/PanelCard.tsx": "Card component displaying panel name, price range, and buy action with event handling.",
  "frontend/src/components/marketing/PanelsSection.tsx": "Renders the panels list with search, duration filtering, and buy flow that opens the payment panel. Manages selected panel state and saves last selection to localStorage.",
  "frontend/src/components/marketing/PaymentPanel.tsx": "Implements a multi‑step payment wizard for selecting duration, paying, and submitting proof. Restores previous selections, handles UPI copy, and builds WhatsApp proof links.",
  "frontend/src/components/marketing/PricingTableSection.tsx": "Displays a full pricing table for all panels with desktop table and mobile card layouts. Pulls panel data from PANELS to show prices across durations.",
  "frontend/src/components/marketing/SectionNavigation.tsx": "Provides a sticky navigation bar for switching between major site sections. Highlights the active section and emits changes to a parent handler.",
  "frontend/src/components/marketing/SiteFooter.tsx": "Renders a minimal footer with branding and rights text. Styled with glass and border effects.",
  "frontend/src/components/marketing/SiteHeader.tsx": "Shows the site header with logo and branding text. Uses a sticky glass‑styled layout.",
  "frontend/src/components/marketing/ThemeToggle.tsx": "Adds a button to toggle light/dark theme using the useTheme hook. Animates sun and moon icons based on active theme.",
  "frontend/src/config/payment.ts": "Exports the UPI_ID constant used for payments.",
  "frontend/src/config/social.ts": "Defines WhatsApp contact number and Discord invite URL constants.",
  "frontend/src/data/panels.ts": "Defines panel and pricing interfaces and exports the PANELS list with all panel names, durations, and prices.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using react‑query. Recreates and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useTheme.ts": "Forces the app into permanent dark mode and ignores any theme changes.",
  "frontend/src/index.css": "Defines global dark-only theme styles, Tailwind layers, and custom cyberpunk/glassmorphism utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/types/react-icons.d.ts": "Adds TypeScript declarations for specific react-icons modules and icon types.",
  "frontend/src/utils/paymentProof.ts": "Builds a WhatsApp link for sending payment proof with optional panel, duration, and amount info.",
  "frontend/src/utils/whatsapp.ts": "Generates a WhatsApp deep link for initiating a purchase message for a given panel.",
  "frontend/src/vite-env.d.ts": "Extends TypeScript env typings for Vite and process.env variables.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, fonts, animations, and neon/glassmorphism design tokens.",
  "frontend/tsconfig.node.json": "TypeScript config for Vite's node-side files with ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Defines Vite config with React plugin, path aliasing, dev proxy, build settings, and env variable injection.",
  "project_state.json": "Tracks project requirements, design direction, known issues, and implementation status for the premium dark-only UI and payment flow redesign."
}