{
  "kind": "build_request",
  "title": "Premium dark UI refresh, improve readability, and replace logo/banner assets",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Redesign the site UI to look more premium with a darker, cleaner cyberpunk palette (dark black/dark gray/dark blue) and consistent spacing/typography across all sections (Header, Section Navigation, Hero, Dashboard, Panels, Pricing Table, Contact, Payment modal).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "UI acha bnao or colour sai sa lgao sai nhi LG rha dark colour lgao apni mrzi sa premium or acha sa UI bnao ..."
        ]
      },
      "acceptanceCriteria": [
        "All primary UI surfaces (page background, glass panels, modals, navigation) use a cohesive dark palette with consistent border/glow treatment (no mismatched grays/blacks between sections).",
        "Buttons/inputs/tabs have consistent premium hover + focus states aligned with the existing cyberpunk/glass style.",
        "No existing flows are removed or broken (section switching, dashboard tabs, panel selection → duration selection → UPI copy → WhatsApp/Discord confirmation)."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Fix site-wide text readability/visibility issues by improving contrast, font sizing, line-height, and background overlays wherever text is hard to see (especially over images and glass panels).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "... or Jo LIKHA ha wo dikh ni rha wo bhi sai kro sb"
        ]
      },
      "acceptanceCriteria": [
        "Hero heading and subtext remain clearly readable over the banner image on mobile and desktop (no washed-out text, no blending into background).",
        "All section headings, card titles, prices, and button labels are readable with strong contrast against their backgrounds in the dark theme.",
        "No text is clipped/cropped/overlapping at common breakpoints (mobile, tablet, desktop)."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Replace the current site logo and banner with new premium versions and update the UI to use the new asset filenames (do not reduce hero text readability when applying the new banner).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "... or logo or banner bhi change kr do SB premium bnao ..."
        ]
      },
      "acceptanceCriteria": [
        "Site header uses the new logo asset instead of the old one.",
        "Hero section uses the new banner asset instead of the old one, with an overlay/opacity treatment that keeps the headline/subtext readable.",
        "All asset references point to files under frontend/public/assets/generated and load correctly in preview (no broken images)."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Audit and correct any conflicting/unused global theme styling so the app consistently renders in the intended dark-only theme without accidental light-theme tokens affecting contrast.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "colour sai sa lgao sai nhi LG rha dark colour lgao"
        ]
      },
      "acceptanceCriteria": [
        "There is a single, consistent source of truth for theme tokens applied to the rendered app (no accidental overrides causing inconsistent foreground/background colors).",
        "After the change, text and surfaces match the intended dark-only palette across all sections and the payment modal."
      ]
    }
  ],
  "constraints": [
    "Do not change backend architecture; backend can remain unchanged.",
    "Do not modify any files under frontend/immutablePaths (compose existing UI components instead).",
    "Keep all existing panel definitions and INR prices unchanged.",
    "Keep WhatsApp number constant as +923137863480 and keep Discord invite URL constant as https://discord.gg/black-exe (no hardcoded replacements).",
    "Preserve the current purchase flow behavior (panel → duration selection → UPI copy → WhatsApp/Discord confirmation) while improving UI/UX and readability."
  ],
  "nonGoals": [
    "Adding new backend features, storage, or databases.",
    "Changing business logic for pricing, durations, or panel availability.",
    "Adding new authentication providers (Internet Identity remains the only supported auth option).",
    "Introducing a light theme or theme toggle."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Premium cyberpunk emblem-style logo with sharper details, transparent background (black-exe-logo-transparent.dim_1024x1024.png > black-exe-logo-premium-transparent.dim_1024x1024.png)",
      "Premium wide cyberpunk banner background with darker, cleaner composition and safe text area for readability (black-exe-banner.dim_1920x720.png > black-exe-banner-premium.dim_1920x720.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}