{
  "kind": "build_request",
  "title": "Update panel pricing (discount INTERNAL + AIMBOT VISIBLE) and add new panel SILENT AIM KRIPTON",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-61",
      "text": "Update the panel catalog pricing so that the panels named \"INTERNAL\" and \"AIMBOT VISIBLE\" have the exact same prices as the \"BASIC\" panel for all durations that BASIC supports (1 DAY, 2 DAYS, 7 DAYS, 1 MONTH, PERMANENT).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "INTERNAL OR AIMBOT VISIBLE KA PRICE SAME BASIC KA PRICE JITNA RAKHO DISCOUNT MA"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/data/panels.ts, the price list for INTERNAL exactly matches BASIC for every duration BASIC has.",
        "In frontend/src/data/panels.ts, the price list for AIMBOT VISIBLE exactly matches BASIC for every duration BASIC has.",
        "Panels UI cards (Available Panels) reflect the updated INTERNAL and AIMBOT VISIBLE price ranges.",
        "Pricing Table section reflects the updated INTERNAL and AIMBOT VISIBLE prices for each duration."
      ]
    },
    {
      "id": "REQ-62",
      "text": "Add a new panel entry to the panel catalog with name \"SILENT AIM KRIPTON\" and include it everywhere panels are rendered (Available Panels grid, search/filter, and the Pricing Table). Use the exact prices provided by the user for the durations they specified.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "PANEL MA 1 CHIZ OR ADD KRO NAME SILENT AIM KRIPTON",
          "SILENT AIM KRIPTON KA PRICE 1 DAY 150 7 DAY 250 7 day 500 1 month 1300 permanent 3k"
        ]
      },
      "acceptanceCriteria": [
        "A new panel named \"SILENT AIM KRIPTON\" is present in the Available Panels grid and is searchable by name.",
        "The new panel appears as its own row/card in the Pricing Table section.",
        "The new panel’s prices in the UI match the values implemented in frontend/src/data/panels.ts (no additional price changes elsewhere)."
      ]
    },
    {
      "id": "REQ-63",
      "text": "Resolve the conflicting/duplicate duration provided for \"SILENT AIM KRIPTON\" before shipping: the user specified two different prices for \"7 DAY\" (250 and 500). Implement the new panel with a single, unambiguous set of duration keys (matching the site’s duration labels, e.g., \"7 DAYS\"), and ensure no panel contains duplicate duration entries in its prices array.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "... 7 DAY 250 7 day 500 ..."
        ]
      },
      "acceptanceCriteria": [
        "The \"SILENT AIM KRIPTON\" panel has no duplicate duration labels in its prices array.",
        "The Pricing Table does not render two values for the same duration for \"SILENT AIM KRIPTON\".",
        "The Panels duration filter continues to function correctly (filtering by a duration only includes panels that define that duration)."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text introduced or modified by this change.",
    "Do not edit files under frontend/src/components/ui (read-only components).",
    "Keep the backend as-is; panel catalog/pricing changes must be done in the frontend data source (frontend/src/data/panels.ts)."
  ],
  "nonGoals": [
    "Do not change any existing panel names other than adding the new \"SILENT AIM KRIPTON\" entry.",
    "Do not change the payment flow, WhatsApp/Discord link behavior, or UPI configuration as part of this request.",
    "Do not introduce new durations beyond the site’s existing duration system unless explicitly confirmed by the user."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}