{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Panel catalog pricing updates and new SILENT AIM KRIPTON panel",
  "requirements": [
    {
      "id": "REQ-61",
      "summary": "Make INTERNAL and AIMBOT VISIBLE pricing exactly match BASIC for all supported durations.",
      "acceptanceCriteria": [
        "In frontend/src/data/panels.ts, the price list for INTERNAL exactly matches BASIC for every duration BASIC has.",
        "In frontend/src/data/panels.ts, the price list for AIMBOT VISIBLE exactly matches BASIC for every duration BASIC has.",
        "Panels UI cards (Available Panels) reflect the updated INTERNAL and AIMBOT VISIBLE price ranges.",
        "Pricing Table section reflects the updated INTERNAL and AIMBOT VISIBLE prices for each duration."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/panels.ts",
          "operation": "modify",
          "description": "Update the INTERNAL and AIMBOT VISIBLE panels' prices arrays so they exactly match BASIC across: 1 DAY, 2 DAYS, 7 DAYS, 1 MONTH, PERMANENT (same duration labels and same numeric prices)."
        }
      ]
    },
    {
      "id": "REQ-62",
      "summary": "Add a new SILENT AIM KRIPTON panel to the catalog so it renders everywhere panels are listed (grid, search/filter, pricing table).",
      "acceptanceCriteria": [
        "A new panel named \"SILENT AIM KRIPTON\" is present in the Available Panels grid and is searchable by name.",
        "The new panel appears as its own row/card in the Pricing Table section.",
        "The new panel’s prices in the UI match the values implemented in frontend/src/data/panels.ts (no additional price changes elsewhere)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/panels.ts",
          "operation": "modify",
          "description": "Add a new panel entry with name \"SILENT AIM KRIPTON\" and the user-provided pricing (after resolving the duplicate 7 DAY conflict per REQ-63), using the site's existing duration labels so it automatically appears in Available Panels, search/filter, and the Pricing Table via the shared PANELS data source."
        }
      ]
    },
    {
      "id": "REQ-63",
      "summary": "Resolve the duplicate/conflicting 7 DAY price for SILENT AIM KRIPTON and ensure no duplicate duration entries exist in any panel prices.",
      "acceptanceCriteria": [
        "The \"SILENT AIM KRIPTON\" panel has no duplicate duration labels in its prices array.",
        "The Pricing Table does not render two values for the same duration for \"SILENT AIM KRIPTON\".",
        "The Panels duration filter continues to function correctly (filtering by a duration only includes panels that define that duration)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/panels.ts",
          "operation": "modify",
          "description": "Implement SILENT AIM KRIPTON with a single unambiguous set of durations (matching existing site labels). Resolve the user's duplicate \"7 DAY\" entries by mapping them to distinct existing durations without introducing new duration types (e.g., interpret 250 as \"2 DAYS\" and 500 as \"7 DAYS\"), and ensure the final prices array contains no duplicate duration strings."
        }
      ]
    }
  ]
}